holographicSol/SatIO_ESP32-P4/SatIO/src/main.cpp
                                    Right Ascension 
                                    |       Azimuth 
                                    |       |       Rise
                                    |       |       |
                                $SUN,0.0,0.0,0.0,0.0,0.0,0.0,*CHECKSUM
                                        |       |       |
                                        |       |       Set 
                                        |       Altitude
                                        Declination 


                                          $MOON SENTENCE

                                                Rise
                                Right Ascension |
                                |       Azimuth | 
                                |       |       |       Phase
                                |       |       |       |
                          $MOON,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,*CHECKSUM
                                    |       |       |       |
                                    |       |       Set     Luminessence
                                    |       Altitude
                                    Declination


                                        $MERCURY SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
              $MERCURY,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude  


                                         $VENUS SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
                $VENUS,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude  


                                        $MARS SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
                 $MARS,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude


                                      $JUPITER SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
              $JUPITER,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude


                                      $SATURN SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
               $SATURN,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude


                                      $URANUS SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
               $URANUS,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude 


                                      $NEPTUNE SENTENCE

                                      Rise
                      Right Ascension |       Helio Ecliptic Latitude
                      |       Azimuth |       |       Radius Vector   
                      |       |       |       |       |       Ecliptic Latitude
                      |       |       |       |       |       |
              $NEPTUNE,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0*CHECKSUM
                          |       |       |       |       |       |
                          |       |       Set     |       |       Ecliptic Longitude
                          |       Altitude        |       Distance
                          Declination             Helio Ecliptic Longitude  
  
  Summary: Over one quintillion possible combinations of stackable logic across N switches for a general purpose
  part or standalone device providing data over serial and or analog/digital output.

  Sentence/element serial output: - may be useful for projects such as with large language models requiring real time environmental data.
                                  - broadcasting data.
                                  - generally making data available for other systems.
  Analog/Digital output: - is also included for projects requiring programmable/variable analog digital output.
                         - indicator lights.
                         - motors.
                         - relays.
                         - other systems/MCU's to read and make use of.
                         - generally application specific.

  To Do: AI I2C modules returning int's as classifiers to SatIO that can be output over serial and or used in compound logic.
  To Do: SRTM data. Use NASA shuttle radar topographical mission data to increase positional awareness.
  To Do: Upgrade gyro to a gyro with higher return rate to increase INS resolution and other gyro related resolutions.
         Gyro experiments will also include a mechanical gyro housing a MEMS gyro core.
         Mechanical gyro electronically rotates MEMS gyro core to calibrate MEMS gyro core.
         This eliminates the need for humans dancing to calibrate the cheap MEMS gyro and may also provide some EMI shielding.
         1 : mechanical gyro rotates MEMS gyro core to align with magentical north.
         2 : calibration starts.
         3 : mechanical gyro rotates MEMS gyro core 360 degrees on each axis.
         4 : calibration ends.
         5 : mechanical gyro rotates MEMS gyro core to face device frontside.
         This MEMS gyro enhancement could glow in different ways to reflect its current state of calibration/non-calibration.
  To Do: Ability to add custom IIC sensor modules after flashing:
              - keep it simple.
              - custom IIC sensor modules should only return int's representing a classifier.
              - ints should be available in matrix compound logic and for output over serial.
              - programmable address + slot space for values (int's).
  To Do: Tuning.
  To Do: PCB fabrication:
              - NANO: no portcontroller, purely user defined data returns, possibly headless.
              - Full: everything, controls and graphical user interface.

  There are some custom libs included in complete project files.
  System is currently headless while being built from draft.
  Complete Project files:
  https://drive.google.com/drive/folders/13yynSxkKL-zxb7iLSkg0v0VXkSLgmtW-?usp=sharing
*/

// ------------------------------------------------------------------------------------------------------------------------------
//                                                                                                                      LIBRARIES
// ------------------------------------------------------------------------------------------------------------------------------

#include <stdio.h>
#include <limits.h>
#include <string.h>
#include <iostream>
#include <assert.h>
#include <float.h>
#include <math.h>

#include <Arduino.h>
#include <Wire.h>

#include "./config.h"
#include "./REG.h"
#include "./strval.h"
#include "./meteors.h"
// #include "./volcanos.h"
#include "./wtgps300p.h"
#include "./wt901.h"
#include "./multiplexers.h"
#include "./esp32_helper.h"
#include "./sidereal_helper.h"
#include "./hextodig.h"
#include "./ins.h"
#include "./satio.h"
#include "./custommapping.h"
#include "./matrix.h"
#include "./serial_infocmd.h"
#include "./system_data.h"
#include "./sdmmc_helper.h"

#include <sys/time.h>
#include <rtc_wdt.h>
#include <esp_task_wdt.h>
#include "esp_pm.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_partition.h"
#include "esp_spiffs.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "driver/uart.h"
#include "SPIFFS.h"

// ------------------------------------------------------------------------------------------------------------------------------
//                                                                                                                          TASKS
// ------------------------------------------------------------------------------------------------------------------------------

