holographicSol/SatIO_ESP32-P4/SatIO/src/main.cpp
  delay(1000);
  // --------------------------------------------------------------
  // xTask Storage.
  // --------------------------------------------------------------
  DELAY_TASK_STORAGE=500;       // delay time/ticks
  TICK_DELAY_TASK_STORAGE=false; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskStorage,   /* Function to implement the task */
    "TaskStorage", /* Name of the task */
    4096,          /* Stack size in words */
    NULL,          /* Task input parameter */
    2,             /* Priority of the task */
    &TaskStorage,  /* Task handle. */
    0);            /* Core where the task should run */
    delay(50);     /* delay between task creation */
  vTaskSuspend(TaskStorage);
  // --------------------------------------------------------------
  // xTask GPS.
  // --------------------------------------------------------------
  DELAY_TASK_GPS=1;         // delay time/ticks
  TICK_DELAY_TASK_GPS=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskGPS,   /* Function to implement the task */
    "TaskGPS", /* Name of the task */
    4096,      /* Stack size in words */
    NULL,      /* Task input parameter */
    3,         /* Priority of the task */
    &TaskGPS,  /* Task handle. */
    0);        /* Core where the task should run */
    delay(50); /* delay between task creation */
  // vTaskSuspend(TaskGPS);
  // --------------------------------------------------------------
  // xTask Serial Information Command.
  // --------------------------------------------------------------
  DELAY_TASK_SERIAL_INFOCMD=1;         // delay time/ticks
  TICK_DELAY_TASK_SERIAL_INFOCMD=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskSerialInfoCMD,   /* Function to implement the task */
    "TaskSerialInfoCMD", /* Name of the task */
    16384,                /* Stack size in words */
    NULL,                /* Task input parameter */
    3,                   /* Priority of the task */
    &TaskSerialInfoCMD,  /* Task handle. */
    0);                  /* Core where the task should run */
    delay(50);           /* delay between task creation */
  // vTaskSuspend(TaskSerialInfoCMD);
  // --------------------------------------------------------------
  // xTask Multiplexers.
  // --------------------------------------------------------------
  DELAY_TASK_MULTIPLEXERS=1;          // delay time/ticks
  TICK_DELAY_TASK_MULTIPLEXERS=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskMultiplexers,   /* Function to implement the task */
    "TaskMultiplexers", /* Name of the task */
    4096,               /* Stack size in words */
    NULL,               /* Task input parameter */
    3,                  /* Priority of the task */
    &TaskMultiplexers,  /* Task handle. */
    0);                 /* Core where the task should run */
    delay(50);          /* delay between task creation */
  vTaskSuspend(TaskMultiplexers);
  // --------------------------------------------------------------
  // xTask Gyro.
  // --------------------------------------------------------------
  DELAY_TASK_GYRO0=1;         // delay time/ticks
  TICK_DELAY_TASK_GYRO0=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskGyro,   /* Function to implement the task */
    "TaskGyro", /* Name of the task */
    4096,       /* Stack size in words */
    NULL,       /* Task input parameter */
    3,          /* Priority of the task */
    &TaskGyro,  /* Task handle. */
    0);         /* Core where the task should run */
    delay(50);  /* delay between task creation */
  vTaskSuspend(TaskGyro);
  // --------------------------------------------------------------
  // xTask Universe.
  // --------------------------------------------------------------
  myAstroBegin(); // call helper library begin function
  DELAY_TASK_UNIVERSE=1;       // delay time/ticks
  TICK_DELAY_TASK_UNIVERSE=false; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskUniverse,   /* Function to implement the task */
    "TaskUniverse", /* Name of the task */
    16384,          /* Stack size in words */
    NULL,           /* Task input parameter */
    1,              /* Priority of the task */
    &TaskUniverse,  /* Task handle. */
    0);             /* Core where the task should run */
    delay(50);      /* delay between task creation */
  vTaskSuspend(TaskUniverse);
  // --------------------------------------------------------------
  // xTask TaskSwitches.
  // --------------------------------------------------------------
  DELAY_TASK_SWITCHES=1;         // delay time/ticks
  TICK_DELAY_TASK_SWITCHES=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskSwitches,   /* Function to implement the task */
    "TaskSwitches", /* Name of the task */
    4096,           /* Stack size in words */
    NULL,           /* Task input parameter */
    4,              /* Priority of the task */
    &TaskSwitches,  /* Task handle. */
    0);             /* Core where the task should run */
  delay(50);        /* delay between task creation */
  vTaskSuspend(TaskSwitches);

  // --------------------------------------------------------------
  // Wait for sync function to complete.
  // --------------------------------------------------------------
  syncTasks();
  // vTaskResume(TaskSerialInfoCMD);
  vTaskResume(TaskStorage);
  vTaskResume(TaskMultiplexers);
  vTaskResume(TaskGyro);
  vTaskResume(TaskUniverse);
  vTaskResume(TaskSwitches);
}

// ------------------------------------------------------------------------------------------------------------------------------
//                                                                                                                      MAIN LOOP
// ------------------------------------------------------------------------------------------------------------------------------
int load_distribution=0;
void loop() {
  getSystemTime();
  systemIntervalCheck();
  intervalBreach1Second();
  // --------------------------------------------------------------
  // Count loops.
  // --------------------------------------------------------------
  systemData.loops_a_second++;
  // vTaskDelay(1 / portTICK_PERIOD_MS);
}

// stat --enable -a
// stat -a
// stat --enable --matrix
// stat --matrix
// stat --enable --gngga
// stat --gngga
